In [19]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [20]:
df = pd.read_csv("Student_Marks.csv")

In [21]:
df.head()

   number_courses  time_study   Marks
0               3       4.508  19.202
1               4       0.096   7.734
2               4       3.133  13.811
3               6       7.909  53.018
4               8       7.811  55.299

In [22]:
x = df.loc[:,['number_courses','time_study']]

In [23]:
y=df.loc[:,['Marks']]

In [24]:
x

    number_courses  time_study
0                3       4.508
1                4       0.096
2                4       3.133
3                6       7.909
4                8       7.811
..             ...         ...
95               6       3.561
96               3       0.301
97               4       7.163
98               7       0.309
99               3       6.335

[100 rows x 2 columns]

In [25]:
y

     Marks
0   19.202
1    7.734
2   13.811
3   53.018
4   55.299
..     ...
95  19.128
96   5.609
97  41.444
98  12.027
99  32.357

[100 rows x 1 columns]

In [26]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [27]:
x_train,x_test,y_train,y_test = train_test_split(x,y, test_size = 0.2, random_state = 10)

In [28]:
model = LinearRegression()
model.fit(x_train,y_train)
LinearRegression()
y_prediction = model.predict(x_test)
from sklearn.metrics import r2_score
r2_score(y_test,y_prediction)

0.9393161544337274

In [29]:
import pickle

In [30]:
file =open('model.pkl','wb')

In [31]:
pickle.dump(model,file)